In [1]:
import pandas as pd

In [98]:
df = pd.read_csv('data/미세먼지_PM2.5__월별_도시별_대기오염도_20231116153601.csv', encoding='ansi')

In [99]:
df.head(3)

,구분(1),구분(2),2015.01,2015.02,2015.03,2015.04,2015.05,2015.06,2015.07,2015.08,...,2022.05,2022.06,2022.07,2022.08,2022.09,2022.10,2022.11,2022.12,2023.01,2023.02
0,총계,소계,28,32,30,24,26,26,21,23,...,17,12,13,10,11,14,23,20,24,28
1,서울특별시,서울특별시,25,30,30,21,22,20,19,22,...,17,12,16,11,11,14,22,19,26,30
2,부산광역시,부산광역시,27,31,27,24,31,30,21,23,...,17,10,12,10,10,11,19,18,21,22

In [100]:
long_df = df.melt(id_vars=['구분(1)', '구분(2)'], 
                  var_name='STD_YYYYMM', 
                  value_name='PM2.5')



# '구분(2)' 열을 'SIDO'로 이름 변경
long_df.rename(columns={'구분(1)': 'SIDO'}, inplace=True)

In [101]:
long_df.to_csv('data/2.5테스트.csv', index=False)

In [102]:
# 'PM2.5' 열의 데이터 타입 확인
print(long_df['PM2.5'].dtypes)

object

In [103]:
# 'PM2.5' 열을 수치형 데이터로 변환
# 숫자로 변환할 수 없는 값은 NaN으로 변환됩니다.
long_df['PM2.5'] = pd.to_numeric(long_df['PM2.5'], errors='coerce')

In [104]:
long_df['AVG_PM2.5'] = long_df.groupby(['SIDO', 'STD_YYYYMM'])['PM2.5'].transform('mean')

In [105]:
# 'AVG_PM2.5' 열을 소수점 두 자리까지 반올림
long_df['AVG_PM2.5'] = long_df['AVG_PM2.5'].round(2)

In [84]:
long_df.tail()

         구분(1) SIDO STD_YYYYMM  PM2.5  AVG_PM2.5
16851     경상남도   합천    2023.02   22.0      22.00
16852     경상남도  도평균    2023.02   21.0      26.56
16853  제주특별자치도   제주    2023.02   17.0      17.00
16854  제주특별자치도  서귀포    2023.02   13.0      13.00
16855  제주특별자치도  도평균    2023.02   15.0      26.56

In [106]:
df3 = long_df.drop_duplicates(subset=['SIDO', 'STD_YYYYMM', 'AVG_PM2.5'])
# SIDO와 STD_YYYYMM 열을 기준으로 중복을 제거
# 중복된 데이터를 제거하면 데이터가 정렬됨

In [107]:
df3.reset_index(drop=True, inplace=True)
# 데이터정렬후 리셋인덱스

In [109]:
df3.head()

    SIDO  구분(2) STD_YYYYMM  PM2.5  AVG_PM2.5
0     총계     소계    2015.01   28.0       28.0
1  서울특별시  서울특별시    2015.01   25.0       25.0
2  부산광역시  부산광역시    2015.01   27.0       27.0
3  대구광역시  대구광역시    2015.01   33.0       33.0
4  인천광역시  인천광역시    2015.01   31.0       31.0

In [110]:
# '구분(2)' 열 삭제
df3.drop('구분(2)', axis=1, inplace=True)

C:\Users\human\AppData\Local\Temp\ipykernel_1788\2030618435.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('구분(2)', axis=1, inplace=True)

In [111]:
# 'PM2.5' 열 삭제
df3.drop('PM2.5', axis=1, inplace=True)

C:\Users\human\AppData\Local\Temp\ipykernel_1788\1379717036.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('PM2.5', axis=1, inplace=True)

In [112]:
# 'SIDO' 열의 값이 '총계'인 행 제거
df3 = df3[df3['SIDO'] != '총계']

In [113]:
df3.tail()

         SIDO STD_YYYYMM  AVG_PM2.5
1759     전라북도    2023.02      30.93
1760     전라남도    2023.02      20.57
1761     경상북도    2023.02      24.04
1762     경상남도    2023.02      21.05
1763  제주특별자치도    2023.02      15.00

In [131]:
# df3의 'STD_YYYYMM' 열의 데이터 타입 확인
dtype_df3 = df3['STD_YYYYMM'].dtype
print("df3의 'STD_YYYYMM' 열의 데이터 타입:", dtype_df3)

df3의 'STD_YYYYMM' 열의 데이터 타입: object

In [133]:
df3['STD_YYYYMM'] = df3['STD_YYYYMM'].str.replace('.', '').astype('int64')

# 결과 확인
print(df3['STD_YYYYMM'].head())
print(df3['STD_YYYYMM'].dtype)

1    201501
2    201501
3    201501
4    201501
5    201501
Name: STD_YYYYMM, dtype: int64
int64

In [114]:
df3.to_csv('data/2.5테스트.csv', index=False)

In [115]:
df1 = pd.read_excel('data/국민건강보험공단_환경성질환(비염) 의료이용정보_20221231.xlsx')

In [116]:
df1.head(3)

   STD_YYYYMM  SIDO    SGG  GEN  AGG  CNT
0      200601    11  11110    1    0  113
1      200601    11  11110    1    1  182
2      200601    11  11110    1    2  154

In [117]:
df1.drop('SGG', axis=1, inplace=True)

In [118]:
df1.head()

   STD_YYYYMM  SIDO  GEN  AGG  CNT
0      200601    11    1    0  113
1      200601    11    1    1  182
2      200601    11    1    2  154
3      200601    11    1    3  600
4      200601    11    1    4  391

In [119]:
# 'STD_YYYYMM'과 'SIDO'를 기준으로 그룹화하고, 'CNT'의 합계를 계산하여 'CNT_SUM' 열에 추가
df1['CNT_SUM'] = df1.groupby(['STD_YYYYMM', 'SIDO'])['CNT'].transform('sum')
# 날짜별과 시도를 기준으로 and로 해서 카운트수를 합침

In [120]:
df1.tail()

        STD_YYYYMM  SIDO  GEN  AGG   CNT  CNT_SUM
611942      202212    50    2    1   611    33172
611943      202212    50    2    2   473    33172
611944      202212    50    2    3  1486    33172
611945      202212    50    2    4  1178    33172
611946      202212    50    2    5   750    33172

In [19]:
df1.to_csv('data/비염한번보기.csv', index= False)

In [121]:
df2 = df1.drop_duplicates(subset=['SIDO', 'STD_YYYYMM', 'CNT_SUM'])
# 시도와 날짜를 기준으로 카운트수를 합쳤기 때문에 
# 중복된 데이터를 제거하면 데이터가 정렬됨

In [122]:
df2.reset_index(drop=True, inplace=True)
# 데이터정렬후 리셋인덱스

In [123]:
df2.tail()

      STD_YYYYMM  SIDO  GEN  AGG  CNT  CNT_SUM
3463      202212    45    1    0  265    72773
3464      202212    46    1    0  175    77897
3465      202212    47    1    0  204   116227
3466      202212    48    1    0  265   172837
3467      202212    50    1    0  585    33172

In [60]:
df2.to_csv('data/비염test2.csv', index=False)

In [124]:
sido_mapping = pd.DataFrame({
    '시도코드': [11, 26, 27, 28, 29, 30, 31, 36, 41, 42, 43, 44, 45, 46, 47, 48, 50],
    '시도명': ['서울특별시', '부산광역시', '대구광역시', '인천광역시', '광주광역시', '대전광역시', '울산광역시', '세종특별자치시', '경기도', '강원도', '충청북도', '충청남도', '전라북도', '전라남도', '경상북도', '경상남도', '제주특별자치도']
})

In [125]:
df2 = pd.merge(df2, sido_mapping, left_on='SIDO', right_on='시도코드')

# 시도명으로 'SIDO' 열을 대체하고 불필요한 열 제거
df2['SIDO'] = df2['시도명']
df2.drop(['시도코드', '시도명'], axis=1, inplace=True)

In [126]:
df2.head()

   STD_YYYYMM   SIDO  GEN  AGG  CNT  CNT_SUM
0      200601  서울특별시    1    0  113   234658
1      200602  서울특별시    1    0  142   190039
2      200603  서울특별시    1    0  240   281952
3      200604  서울특별시    1    0  192   270801
4      200605  서울특별시    1    0  175   223894

In [127]:
df2.tail()

      STD_YYYYMM     SIDO  GEN  AGG   CNT  CNT_SUM
3463      202208  제주특별자치도    1    0   658    21942
3464      202209  제주특별자치도    1    0   973    22190
3465      202210  제주특별자치도    1    0  1162    32033
3466      202211  제주특별자치도    1    0   610    27187
3467      202212  제주특별자치도    1    0   585    33172

In [128]:
df2.isna().sum()

STD_YYYYMM    0
SIDO          0
GEN           0
AGG           0
CNT           0
CNT_SUM       0
dtype: int64

In [132]:
# df2의 'STD_YYYYMM' 열의 데이터 타입 확인
dtype_df2 = df2['STD_YYYYMM'].dtype
print("df2의 'STD_YYYYMM' 열의 데이터 타입:", dtype_df2)

df2의 'STD_YYYYMM' 열의 데이터 타입: int64

In [134]:
# df2와 df3을 'STD_YYYYMM'과 'SIDO'를 기준으로 inner join 수행
merged_df = pd.merge(df2, df3, on=['STD_YYYYMM', 'SIDO'], how='inner')

# 결과 확인
print(merged_df.head())

   STD_YYYYMM   SIDO  GEN  AGG  CNT  CNT_SUM  AVG_PM2.5
0      201501  서울특별시    1    0  190   377167       25.0
1      201502  서울특별시    1    0  164   391955       30.0
2      201503  서울특별시    1    0  271   456140       30.0
3      201504  서울특별시    1    0  253   429844       21.0
4      201505  서울특별시    1    0  212   320863       22.0

In [135]:
merged_df.to_csv('data/2.5비염합침테스트.csv', index=False)